InformationRegisters/НастройкаПередачиТоваровМеждуОрганизациями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкаПередачиТоваровМеждуОрганизациями</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КонтрагентВладельца</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПродавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособПередачиТоваров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПередачиТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВозвратаТоваров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВозвратаТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаУчетаВозвратов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействияНастройки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиныйДокументЗаМесяц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОрганизацияВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОрганизацияПродавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыВозвратаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыВозвратаТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшениеПередачи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыПередачиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыПередачиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПередается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкаПередачиТоваровМеждуОрганизациями/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ТолькоПросмотр И Не ЗначениеЗаполнено(Запись.Приоритет) Тогда
		УстановитьПорядокПоУмолчанию();
	КонецЕсли;

	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();

	АвтоматическиУменьшатьПередачи = (Запись.СпособВозвратаТоваров = ПредопределенноеЗначение(
		"Перечисление.СпособыВозвратаТоваров.УменьшениеПередачи"));
	
	// Заполнения по умолчанию
	Если Не ТолькоПросмотр И (Не ЗначениеЗаполнено(Запись.СпособПередачиТоваров)
		Или Элементы.СпособПередачиТоваров.СписокВыбора.НайтиПоЗначению(Запись.СпособПередачиТоваров) = Неопределено) Тогда
		Запись.СпособПередачиТоваров = Перечисления.СпособыПередачиТоваров.НеПередается;
	КонецЕсли;
	Если Не ТолькоПросмотр И Не ЗначениеЗаполнено(Запись.СпособВозвратаТоваров) Тогда
		Запись.СпособВозвратаТоваров = Перечисления.СпособыВозвратаТоваров.НеТребуется;
	КонецЕсли;

	Если Запись.СпособПередачиТоваров <> Перечисления.СпособыПередачиТоваров.НеПередается И ЗначениеЗаполнено(
		Запись.ИсходныйКлючЗаписи.ОрганизацияВладелец)
		И РегистрыСведений.НастройкаПередачиТоваровМеждуОрганизациями.ЕстьНезакрытыеРезервы(Запись.ОрганизацияВладелец,
		Запись.ОрганизацияПродавец) Тогда
		ТолькоПросмотр = Истина;
		КлючСохраненияПоложенияОкна = "РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями.ФормаЗаписи.ВариантСПредупреждением";
	Иначе
		Если Запись.СпособПередачиТоваров = Перечисления.СпособыПередачиТоваров.НеПередается Тогда
			КлючСохраненияПоложенияОкна = "РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями.ФормаЗаписи.ВариантБезПередачи";
		КонецЕсли;
		Элементы.ГруппаПредупрежденияРезервы.Видимость = Ложь;
	КонецЕсли;
	УправлениеЭлементамиФормы();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если Запись.СпособПередачиТоваров <> Перечисления.СпособыПередачиТоваров.НеПередается
		И Не ТекущийОбъект.ОрганизацияВладелец.Пустая() И Не ТекущийОбъект.ОрганизацияПродавец.Пустая()
		И ТекущийОбъект.Договор.Пустая() Тогда

		ШаблонНаименования = НСтр("ru = 'Договор передачи между %1 и %2'");
		НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		НовыйДоговор.Организация = Запись.ОрганизацияВладелец;
		НовыйДоговор.Владелец = Запись.ОрганизацияПродавец;
		НовыйДоговор.ЭтоДоговорПередачиТоваровМеждуОрганизациями = Истина;
		НовыйДоговор.Наименование = СтрШаблон(ШаблонНаименования, Запись.ОрганизацияВладелец,
			Запись.ОрганизацияПродавец);
		НовыйДоговор.ВалютаРасчетов = УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета();
		НовыйДоговор.ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем;
		НовыйДоговор.ВидЦен = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			Пользователи.АвторизованныйПользователь(), "ОсновнойВидЦенПродажи");
		НовыйДоговор.СпособРазнесенияОплатыПоУмолчанию = РасчетыРаботаСФормамиВызовСервера.ПолучитьСпособРазнесенияОплатыПоУмолчанию();
		НовыйДоговор.СпособЗачетаПредоплатыПоУмолчанию = РасчетыРаботаСФормамиВызовСервера.ПолучитьСпособЗачетаПредоплатыПоУмолчанию();
		Если НовыйДоговор.ВидЦен.Пустая() Тогда
			НовыйДоговор.ВидЦен = Справочники.ВидыЦен.Оптовая;
		КонецЕсли;

		НовыйДоговор.Записать();

		ТекущийОбъект.Договор = НовыйДоговор.Ссылка;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Если ОписаниеОповещенияОЗакрытии <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, Запись);
	КонецЕсли;
	Оповестить(ИнтеркампаниКлиентСервер.ИмяСобытияЗаписьНастройки(), Запись.ОрганизацияПродавец);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	ОписаниеОповещенияОЗакрытии = Неопределено;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияВладелецПриИзменении(Элемент)

	Запись.КонтрагентВладельца = КонтрагентИнтеркампани(Запись.ОрганизацияВладелец);

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПродавецПриИзменении(Элемент)

	Запись.КонтрагентПродавец = КонтрагентИнтеркампани(Запись.ОрганизацияПродавец);
	УстановитьПорядокПоУмолчанию();

КонецПроцедуры

&НаКлиенте
Процедура СпособПередачиТоваровПриИзменении(Элемент)

	СпособПередачиТоваровПриИзмененииСервер();

КонецПроцедуры

&НаКлиенте
Процедура АвтоматическиУменьшатьПередачиПриИзменении(Элемент)

	Если АвтоматическиУменьшатьПередачи Тогда
		Запись.СпособВозвратаТоваров = ПредопределенноеЗначение(
			"Перечисление.СпособыВозвратаТоваров.УменьшениеПередачи");
	Иначе
		Запись.СпособВозвратаТоваров = ПредопределенноеЗначение("Перечисление.СпособыВозвратаТоваров.НеТребуется");
	КонецЕсли;
	АвтоматическиУменьшатьПередачиПриИзмененииСервер();

КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ПараметрыФормы = ПолучитьПараметрыФормыВыбора(Запись.ОрганизацияВладелец, Запись.ОрганизацияПродавец,
		Запись.Договор);
	Если ПараметрыФормы.КонтролироватьВыборДоговора Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, Элемент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаРазрешитьРедактированиеНастроек(Команда)

	Если ТолькоПросмотр Тогда

		Если ЭтоПолноправныйПользователь Тогда
			Оповещение = Новый ОписаниеОповещения("РазрешитьРедактированиеЗавершение", ЭтотОбъект);
			ТекстВопроса = НСтр("ru = 'По данным организациям существует остаток резервов к передаче. Изменение настроек не рекомендуется.
								|Все равно разрешить редактирование?'");
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе

			ТекстПредупреждения = НСтр(
				"ru = 'Изменять действующие настройки может только пользователь с полными правами'");
			ПоказатьПредупреждение( , ТекстПредупреждения);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеЗавершение(Результат, ДополнительныйПараметр) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ТолькоПросмотр = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеЭлементамиФормы

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	ПередачаИспользуется = Запись.СпособПередачиТоваров <> Перечисления.СпособыПередачиТоваров.НеПередается;
	
	Элементы.Валюта.Видимость = (Запись.СпособПередачиТоваров = Перечисления.СпособыПередачиТоваров.ПередачаНаКомиссию)
		И ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	Элементы.ВидЦены.Видимость = ПередачаИспользуется;
	Элементы.Договор.Видимость = ПередачаИспользуется;
	Элементы.АвтоматическиУменьшатьПередачи.Видимость = ПередачаИспользуется;
	Элементы.ЕдиныйДокументЗаМесяц.Видимость = ПередачаИспользуется;
	Элементы.ДатаНачалаУчетаВозвратов.Видимость = (ЗначениеЗаполнено(Запись.СпособВозвратаТоваров)
		И Запись.СпособВозвратаТоваров <> Перечисления.СпособыВозвратаТоваров.НеТребуется);

КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура СпособПередачиТоваровПриИзмененииСервер()

	Если Запись.СпособПередачиТоваров <> Перечисления.СпособыПередачиТоваров.ПередачаНаКомиссию Тогда
		Запись.Валюта = Неопределено;
	КонецЕсли;

	Если Запись.СпособПередачиТоваров = Перечисления.СпособыПередачиТоваров.НеПередается Тогда
		Запись.ВидЦены = Неопределено;
	КонецЕсли;

	Запись.Договор = Неопределено;

	УправлениеЭлементамиФормы();

КонецПроцедуры

&НаСервере
Процедура АвтоматическиУменьшатьПередачиПриИзмененииСервер()

	Если АвтоматическиУменьшатьПередачи Тогда
		Запись.ДатаНачалаУчетаВозвратов = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;

	УправлениеЭлементамиФормы();

КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()

	Если ЗначениеЗаполнено(Запись.Договор) Тогда
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Договор, "ВидЦен, ВалютаРасчетов");
		Запись.ВидЦены = ЗначенияРеквизитов.ВидЦен;
		Запись.Валюта = ЗначенияРеквизитов.ВалютаРасчетов;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)

	ДоговорПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормыВыбора(Организация, Контрагент, Договор)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КонтролироватьВыборДоговора", Истина);
	ПараметрыФормы.Вставить("Контрагент", Контрагент);
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Договор);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);

	Возврат ПараметрыФормы;

КонецФункции

&НаСервереБезКонтекста
Функция КонтрагентИнтеркампани(Организация)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "КонтрагентИнтеркампани", Истина);

КонецФункции

&НаСервере
Процедура УстановитьПорядокПоУмолчанию()

	Если Не ЗначениеЗаполнено(Запись.ОрганизацияПродавец) Тогда
		Запись.Приоритет = 0;
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияПродавец", Запись.ОрганизацияПродавец);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(НастройкаПередачиТоваровМеждуОрганизациями.Приоритет) КАК Приоритет
	|ИЗ
	|	РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями КАК НастройкаПередачиТоваровМеждуОрганизациями
	|ГДЕ
	|	НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияПродавец = &ОрганизацияПродавец";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Приоритет) Тогда
		Запись.Приоритет = Выборка.Приоритет + 1;
	Иначе
		Запись.Приоритет = 1;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
